<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<link href="../layout/layout.css" rel="stylesheet" type="text/css">
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
<div id = "항공기초과저지">
	<h5>항공기초과저지</h5>
	<p>
		자격증도 많고 경험도 풍부한 당신! 항공기 초과저지 특기로 군생활을 꿀 빨아보는 건 어떤가요?<br>
		지금 바로 항공기 초과저지가 어떤 특기인지 살펴보세요!
	</p>
</div>
<div id = "항공기제작정비">
	<h5>항공기 제작정비</h5>
	<p>
		자격증도 많고 경험도 풍부한 당신! 항공기 제작정비 특기로 군생활을 꿀 빨아보는 건 어떤가요?<br>
		지금 바로 항공기 제작정비가 어떤 특기인지 살펴보세요!
	</p>
</div>
<div id = "항공기지상장비정비">
	<h5>항공기 지상장비정비</h5>
	<p>
		자격증도 많고 경험도 풍부한 당신! 항공기 지상장비정비 특기로 군생활을 꿀 빨아보는 건 어떤가요?<br>
		지금 바로 항공기 지상장비정비가 어떤 특기인지 살펴보세요!
	</p>
</div>
<div id = "기타기계특기">
	<h5>비파괴 검사 or 기계설비 or 항공기기관정비</h5>
	<p>
		음... 가지고 있는 자격증이 기계 꿀특기 3대장에 부합하지 않네요...<br>
		비파괴 검사는 일이 편한 편이지만 그만큼 경쟁률이 센 편입니다. 당연히 특기시험을 잘 봐야겠죠?<br>
		반면, 기계설비나 기관정비는 경쟁률이 상대적으로 덜하지만 그만큼 업무 강도는 셉니다.
		어떤 특기가 마음에 드시나요? 지금 바로 검색해보세요! 
	</p>
</div>

<div id = "기상관측">
	<h5>기상관측</h5>
	<p>
		가지고 계신 자격증 또는 하시는 전공이 기상관측 특기에 부합하네요!<br>
		기상관측 특기로 21개월을 꿀 빨아보는 건 어떨까요?
		지금 바로 기상관측 특기가 어떤 특기인지 살펴보세요!
	</p>
</div>
<div id = "단거리유도무기운용">
	<h5>단거리유도무기운용</h5>
	<p>
		가지고 계신 자격증 또는 하시는 전공이 단거리유도무기운용 특기에 부합하네요!<br>
		단거리유도무기운용 특기로 21개월을 꿀 빨아보는 건 어떨까요?
		지금 바로 단거리유도무기운용 특기가 어떤 특기인지 살펴보세요!
	</p>
</div>
<div id = "장비물자보급">
	<h5>장비물자보급</h5>
	<p>
		장비물자보급은 자격증 없이 전공만으로도 뚫을 수 있는 특기!<br>
		장비물자보급 특기로 21개월을 꿀 빨아보는 건 어떨까요?
		지금 바로 장비물자보급 특기가 어떤 특기인지 살펴보세요!
	</p>
</div>
<div id = "인사교육">
	<h5>인사교육</h5>
	<p>
		가지고 계신 자격증 또는 하시는 전공이 인사교육 특기에 부합하네요!<br>
		인사교육 특기로 21개월을 보내시는 게 어떨까요? 다만 인사교육 헬총무 자리는 꽤나 힘들 수 있습니다.
		지금 바로 인사교육 특기가 어떤 특기인지 살펴보세요!
	</p>
</div>
<div id = "운항관제">
	<h5>운항관제</h5>
	<p>
		가지고 계신 자격증 또는 하시는 전공이 운항관제 특기에 부합하네요!<br>
		운항관제 특기로 21개월을 보내시는 게 어떨까요? 다만 운항관제 특기는 크루제입니다.
		지금 바로 운항관제 특기가 어떤 특기인지 살펴보세요!
	</p>
</div>
<div id = "항공통제">
	<h5>항공통제</h5>
	<p>
		항공통제는 자겨증도 전공도 필요없이 오로지 특기시험으르 결정되는 특기!<br>
		항공통제 특기로 21개월을 보내시는 게 어떨까요? 다만 항공통제 특기는 크루제입니다.
		지금 바로 항공통제 특기가 어떤 특기인지 살펴보세요!
	</p>
</div>
<div id = "기타일반특기">
	<h5>항공통제 or 항공운수 or 소방</h5>
	<p>
		음... 가지고 있는 자격증이 일반 꿀특기에 부합하지 않네요...<br>
		어떤 특기가 마음에 드시나요? 지금 바로 검색해보세요! 
	</p>
</div>
<div id = "기타헌급방특기">
	<h5>소규모 급양</h5>
	<p>
		헌급방 지정 특기가 단유운을 떨어진 이상, 마지막 희망은 소규모 급양 뿐입니다.<br>
		행운을 빕니다.
	</p>
</div>

<div id = "지상레이더체계정비">
	<h5>지상레이더체계정비</h5>
	<p>
		가지고 계신 자격증 또는 하시는 전공이 지상레이더체계정비 특기에 부합하네요!<br>
		지상레이더체계정비 특기로 21개월을 꿀 빨아보시는 건 어떨까요? 다만 레이더 꿀보직은 점점 사라지고 있는 추세입니다.
		지금 바로 지상레이더체계정비 특기가 어떤 특기인지 살펴보세요!
	</p>
</div>

<div id = "방공유도무기정비">
	<h5>방공유도무기정비</h5>
	<p>
		가지고 계신 자격증 또는 하시는 전공이 방공유도무기정비 특기에 부합하네요!<br>
		방공유도무기정비 특기로 21개월을 보내시는 게 어떨까요? 다만 방유정 특기 TO가 나오지 않을 수도 있습니다.
		지금 바로 방공유도무기정비 특기가 어떤 특기인지 살펴보세요!
	</p>
</div>
<div id = "무선통신체계정비">
	<h5>무선통신체계정비</h5>
	<p>
		가지고 계신 자격증 또는 하시는 전공이 무선통신체계정비 특기에 부합하네요!<br>
		무선통신체계정비 특기로 21개월을 꿀 빨아보시는 건 어떨까요? 다만 무선 꿀보직은 점점 사라지고 있는 추세입니다.
		지금 바로 무선통신체계정비 특기가 어떤 특기인지 살펴보세요!
	</p>
</div>
<div id = "항공전자장비정비">
	<h5>항공전자장비정비</h5>
	<p>
		가지고 계신 자격증 또는 하시는 전공이 항공전자장비정비 특기에 부합하네요!<br>
		항공전자장비정비 특기로 21개월을 보내시는 게 어떨까요?
		지금 바로 항공전자장비정비 특기가 어떤 특기인지 살펴보세요!
	</p>
</div>
<div id = "기타통신전자전기특기">
	<h5>전력설비 or 유선통신체계정비</h5>
	<p>
		통신전자전기가 레항무방을 못 쓸 경우, 차선책은 전력설비와 유선 특기 정도가 있습니다.<br>
		전력설비는 유선과 비교해봤을 때, 업무 강도가 약하지만 편차가 큰 특기이며,
		유선 특기의 경우, 상대적으로 일은 강하지만 자대별 업무 편차가 그렇게 크지는 않습니다.<br><br>
		
		그밖의 경우, 전술항공통신체계정비는 특기시험으로만 결정되는 특기이며,
		최악의 경우 무탄 중 하나를 써야할 상황이라면 항공 탄약정비가 그나마 덜 힘들다고 합니다.
	</p>
</div>

<input type="button" class="show" id="show" value="결과" onclick="show()">
<script>
	function show() {
		if(localStorage.getItem("class") == "기계")
			alert(	"항공기초과저지 : " + localStorage.getItem("항공기초과저지");+"\n"
					+ "항공기지상장비정비 : " + localStorage.getItem("항공기지상장비정비")+"\n"
					+ "항공기제작정비 : " + localStorage.getItem("항공기제작정비")+"\n"
					+ "비파괴검사 : " + localStorage.getItem("비파괴검사"));
		if(localStorage.getItem("class") == "일반")
			alert(	"기상관측 : " + localStorage.getItem("기상관측")+"\n"
					+ "단거리유도무기운용 : " + localStorage.getItem("단거리유도무기운용")+"\n"
					+ "장비물자보급 : " + localStorage.getItem("장비물자보급")+"\n"
					+ "인사교육 : " + localStorage.getItem("인사교육")+"\n"
					+ "운항관제 : " + localStorage.getItem("운항관제")+"\n"
					+ "항공통제 : " + localStorage.getItem("항공통제"));
		if(localStorage.getItem("class") == "일반(헌급방 지정)")
			alert(	"단거리유도무기운용 : " + localStorage.getItem("단거리유도무기운용"));
		if(localStorage.getItem("class") == "차량운전")
			alert(	"일반차량운전 : " + localStorage.getItem("일반차량운전"));
		if(localStorage.getItem("class") == "통신전자전기")
			alert(	"지상레이더체계정비 : " + localStorage.getItem("지상레이더체계정비")+"\n"
					+ "방공유도무기정비 : " + localStorage.getItem("방공유도무기정비")+"\n"
					+ "무선통신체계정비 : " + localStorage.getItem("무선통신체계정비")+"\n"
					+ "항공전자장비정비 : " + localStorage.getItem("항공전자장비정비"));
	}
</script>
</body>
</html>